chemary/nrf52_ble_long_range/peripheral_long_range_demo_kit/main.c
    if (m_gap_role == BLE_GAP_ROLE_PERIPH) {
        NRF_LOG_INFO("Connected as a peripheral.");
    } else if (m_gap_role == BLE_GAP_ROLE_CENTRAL) {
        NRF_LOG_INFO("Connected as a central. Should not happen.");
    }

    // If advertising, stop advertising.
    (void)sd_ble_gap_adv_stop(m_adv_handle);
}

/**@brief Function for handling BLE_GAP_EVT_DISCONNECTED events.
 * Unset the connection handle and restart advertising if needed.
 */
static void on_ble_gap_evt_disconnected(ble_gap_evt_t const *p_gap_evt) {
    m_conn_handle = BLE_CONN_HANDLE_INVALID;
    m_waiting_for_disconnect_evt = false;

    NRF_LOG_INFO("Disconnected: reason 0x%x.", p_gap_evt->params.disconnected.reason);

    if (m_app_initiated_disconnect == false) // (If the app itself (button push) has initiated a disconnect, bsp_evt_handler will start the advertising.)
    {
        // Start advertising with the current setup.
        set_current_adv_params_and_start_advertising();
    }
}

/**@brief Function for handling scan request report.
 * Print the RSSI and address of the initiator if the RSSI has changed.
 */
static void on_scan_req_report(ble_gap_evt_scan_req_report_t const *p_scan_req_report) {
    static int8_t rssi_value = 0;

    if (rssi_value != p_scan_req_report->rssi) {
    rssi_value = p_scan_req_report->rssi;
    NRF_LOG_INFO("Received scan request with RSSI %d .", rssi_value);
    NRF_LOG_INFO("addr %02x:%02x:%02x:%02x:%02x:%02x",
        p_scan_req_report->peer_addr.addr[0],
        p_scan_req_report->peer_addr.addr[1],
        p_scan_req_report->peer_addr.addr[2],
        p_scan_req_report->peer_addr.addr[3],
        p_scan_req_report->peer_addr.addr[4],
        p_scan_req_report->peer_addr.addr[5]);
    }
}

/**@brief Function for handling BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context) {
    uint32_t err_code;
    ble_gap_evt_t const *p_gap_evt = &p_ble_evt->evt.gap_evt;
    ble_gap_conn_params_t params;

    switch (p_ble_evt->header.evt_id) {
        case BLE_GAP_EVT_CONNECTED:
            on_ble_gap_evt_connected(p_gap_evt);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            on_ble_gap_evt_disconnected(p_gap_evt);
            break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
            NRF_LOG_INFO("Connection interval updated: 0x%x, 0x%x.",
            p_gap_evt->params.conn_param_update.conn_params.min_conn_interval,
            p_gap_evt->params.conn_param_update.conn_params.max_conn_interval);
            break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
            // Accept parameters requested by the peer.
            params = p_gap_evt->params.conn_param_update_request.conn_params;
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle, &params);
            APP_ERROR_CHECK(err_code);

            NRF_LOG_INFO("Connection interval updated (upon request): 0x%x, 0x%x.",
            p_gap_evt->params.conn_param_update_request.conn_params.min_conn_interval,
            p_gap_evt->params.conn_param_update_request.conn_params.max_conn_interval);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            NRF_LOG_DEBUG("BLE_GATTS_EVT_SYS_ATTR_MISSING");
            err_code = sd_ble_gatts_sys_attr_set(p_gap_evt->conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTC_EVT_TIMEOUT: // Fallthrough.
        case BLE_GATTS_EVT_TIMEOUT:
            NRF_LOG_DEBUG("GATT timeout, disconnecting.");
            err_code = sd_ble_gap_disconnect(m_conn_handle,
            BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_PHY_UPDATE:
            NRF_LOG_DEBUG("BLE_GAP_EVT_PHY_UPDATE: not implemented.");
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
            NRF_LOG_DEBUG("BLE_GAP_EVT_PHY_UPDATE_REQUEST: not implemented.");
            break;

        case BLE_GAP_EVT_SCAN_REQ_REPORT:
            on_scan_req_report(&p_gap_evt->params.scan_req_report);
            break;

        default:
            NRF_LOG_DEBUG("Received an unimplemented BLE event.");
            break;
    }
}

/**@brief This function will disconnect if connected, and stop advertising if advertising. */
static void disconnect_stop_adv(void) {
    ret_code_t err_code;
    // If advertising, stop advertising.
    (void)sd_ble_gap_adv_stop(m_adv_handle);

    // If connected, disconnect.
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
        NRF_LOG_INFO("Disconnecting...");

        m_app_initiated_disconnect = true;
        m_waiting_for_disconnect_evt = true;
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

        if (err_code != NRF_SUCCESS) {
            NRF_LOG_ERROR("disconnect_stop_adv, sd_ble_gap_disconnect() failed: 0x%0x.", err_code);
            m_app_initiated_disconnect = false;
            m_waiting_for_disconnect_evt = false;
        }
        while (m_waiting_for_disconnect_evt == true) {
        // Wait until BLE_GAP_EVT_DISCONNECT has occured.
        }
    }
}

/**@brief Function for setting up advertising data. */
static void advertising_data_set(bool set_adv_params) {
    ret_code_t ret;

    ble_advdata_service_data_t service_data[3];

    service_data[0].service_uuid =  0x1801;
    service_data[0].data.size = sizeof(m_custom_adv_data.vbatt);
    service_data[0].data.p_data = (uint8_t *)&m_custom_adv_data.vbatt;

    service_data[1].service_uuid = BLE_UUID_HEALTH_THERMOMETER_SERVICE;
    service_data[1].data.size = sizeof(m_custom_adv_data.temp);
    service_data[1].data.p_data = (uint8_t *)&m_custom_adv_data.temp;

    service_data[2].service_uuid = 0x1801;
    service_data[2].data.size = sizeof(m_custom_adv_data.sec_cnt);
    service_data[2].data.p_data = (uint8_t *)&m_custom_adv_data.sec_cnt;

    ble_advdata_t const adv_data = {
        .name_type = BLE_ADVDATA_FULL_NAME,
        .flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE,
        .include_appearance = false,
        .service_data_count = 3,
        .p_service_data_array = service_data
    };

