chemary/nrf52_ble_long_range/peripheral_long_range_demo_kit/main.c
    /* swap adv data buffer - from API doc: "In order to update advertising 
    data while advertising, new advertising buffers must be provided"*/
    m_adv_data.adv_data.p_data = (m_adv_data.adv_data.p_data == m_enc_advdata[0])
                                ? m_enc_advdata[1] : m_enc_advdata[0];

    ret = ble_advdata_encode(&adv_data, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(ret);

    if (!set_adv_params) {
        // Only update advertising data while advertising
        ret = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, NULL);
        APP_ERROR_CHECK(ret);
        return;
    }

    ble_gap_adv_params_t adv_params = {
        .properties = {
            .type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED,
        },
        .p_peer_addr = NULL,
        .filter_policy = BLE_GAP_ADV_FP_ANY,
        .interval = adv_interval,
        .duration = 0,

        .primary_phy = BLE_GAP_PHY_1MBPS, // Must be changed to connect in long range. (BLE_GAP_PHY_CODED)
        .secondary_phy = BLE_GAP_PHY_1MBPS,
        .scan_req_notification = 1,
    };

    if (m_adv_scan_phy_selected == SELECTION_1M_PHY) {
        // 1M coded for adv
        // NRF_LOG_INFO("Setting adv params PHY to 1M. ");
        adv_params.primary_phy = BLE_GAP_PHY_1MBPS;
        adv_params.secondary_phy = BLE_GAP_PHY_1MBPS;

        if (m_adv_scan_type_selected == SELECTION_CONNECTABLE) {
            // NRF_LOG_INFO("Advertising type set to CONNECTABLE_SCANNABLE_UNDIRECTED ");
            adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
        } else if (m_adv_scan_type_selected == SELECTION_NON_CONNECTABLE) {
            // NRF_LOG_INFO("Advertising type set to NONCONNECTABLE_SCANNABLE_UNDIRECTED ");
            adv_params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED;
        }
    }
    else if (m_adv_scan_phy_selected == SELECTION_CODED_PHY) {
        // only extended advertising will allow primary phy to be coded
        // NRF_LOG_INFO("Setting adv params phy to coded phy .. ");
        adv_params.primary_phy  = BLE_GAP_PHY_CODED;
        adv_params.secondary_phy = BLE_GAP_PHY_CODED;

        if (m_adv_scan_type_selected == SELECTION_CONNECTABLE) {
            //NRF_LOG_INFO("Advertising type set to EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED ");
            adv_params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;
        } else if (m_adv_scan_type_selected == SELECTION_NON_CONNECTABLE) {
            // NRF_LOG_INFO("Advertising type set to EXTENDED_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED ");
            adv_params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
        }
    }

    ret = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
    APP_ERROR_CHECK(ret);
}

/**@brief Function for starting advertising. */
static void advertising_start(void) {
    ret_code_t err_code;
    //NRF_LOG_INFO("Starting advertising.");

    err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_adv_handle, m_output_power_selected);
    APP_ERROR_CHECK(err_code);

    //NRF_LOG_INFO("Output power set to %d dBm", m_output_power_selected);

    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
    m_app_initiated_disconnect = false;
}

/**@brief Function for initializing the log module.
 */
static void log_init(void) {
    uint32_t log_timestamp_func(void) {
        return m_sensors_data.le_sec_cnt;
    }
    ret_code_t err_code = NRF_LOG_INIT(log_timestamp_func, 1); // Counter is incremented at 1Hz rate
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates application timers.
 */
static void timers_init(void) {
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_battery_timer_id, APP_TIMER_MODE_REPEATED, advdata_update_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void) {
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

/**@brief Function for initializing GAP parameters.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name and the preferred connection parameters.
 */
static void gap_params_init(void) {
    ret_code_t err_code;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode, (uint8_t const *)DEVICE_NAME, strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_ppcp_set(&m_conn_param);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT library. */

/**@brief Function for initializing power management.
 */
static void power_management_init(void) {
    ret_code_t ret;
    ret = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(ret);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details Handle any pending operation(s), then sleep until the next event occurs.
 */
static void idle_state_handle(void) {
    if (NRF_LOG_PROCESS() == false) {
        nrf_pwr_mgmt_run();
    }
}

/**@brief Function for switching between "non-connectable and connectable advertising" selection.
 * Note: this function does only set the internal "advertising state", it does not start advertising.
 *       The new advertising mode will be used when (re-)starting to advertise.
 */
static void on_non_conn_or_conn_adv_selection(void) {
    // Change the advertising type
    adv_scan_type_seclection_t new_adv_selection;

    switch (m_adv_scan_type_selected) {
        case SELECTION_CONNECTABLE: // Connectable advertising is the previous state.
            // Current state is non-connectable advertising. Start blinking associated LED.
            new_adv_selection = SELECTION_NON_CONNECTABLE;
            break;
        case SELECTION_NON_CONNECTABLE:
            // Current state is connectable advertising. Start blinking associated LED.
            new_adv_selection = SELECTION_CONNECTABLE;
            break;
    }
    m_adv_scan_type_selected = new_adv_selection;
    NRF_LOG_INFO("Mode changed to: %d", m_adv_scan_type_selected);
}

/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
void bsp_evt_handler(bsp_event_t event) {
    ret_code_t err_code;

    // Set the correct parameters, depending on the button pushed.
    switch (event) {
        case NON_CONN_OR_CONN_ADV_BUTTON_EVENT:
            on_non_conn_or_conn_adv_selection();
            break;
        default:
            break;
    }

    disconnect_stop_adv();
    advertising_data_set(true);
    advertising_start();
}

/**@brief Function for initializing buttons and leds.
 */
static void buttons_leds_init(void) {
    ret_code_t err_code;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_evt_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising with the current selections of output power, phy, and connectable or non-connectable advertising.
 */
static void set_current_adv_params_and_start_advertising(void) {
    advertising_data_set(true);
    advertising_start();
}

/**@brief Function for updating the VBATT field of TLM*/
static void update_vbatt(void) {
    uint16_t vbatt;
    battery_voltage_get(&vbatt); // Get new battery voltage

    if (vbatt < LOW_POWER_VOLTAGE && m_power_mode == POWER_MODE_NORMAL) {
        NRF_LOG_ERROR("Low voltage (%d), set slow advertisement", vbatt);
        m_power_mode = POWER_MODE_LOW_BATT;
        adv_interval = ADV_INTERVAL_SLOW;
        // m_output_power_selected = SELECTION_0_dBm;
        disconnect_stop_adv();
        advertising_data_set(true);
        advertising_start();
    }

    if (vbatt < CUT_OFF_VOLTAGE && m_sensors_data.le_sec_cnt > CUT_OFF_VOLTAGE_POWER_UP_DELAY) {
        NRF_LOG_ERROR("Cut-off voltage reached (%d), going to sleep", vbatt);
        nrf_power_system_off();
        while(1);
    }

    m_sensors_data.vbuff_pos = (m_sensors_data.vbuff_pos + 1) % SENSORS_BUFFER_LEN;
    m_sensors_data.vbatt_samples[m_sensors_data.vbuff_pos] = vbatt;

    uint32_t sum = 0;
    for (int i = 0; i < SENSORS_BUFFER_LEN; i++) {
        sum += m_sensors_data.vbatt_samples[i];
    }
    m_sensors_data.vbatt = sum/SENSORS_BUFFER_LEN;


