chemary/nrf52_ble_long_range/peripheral_long_range_demo_kit/main.c
    //if (m_sensors_data.vbatt > 3500) {
    //    m_custom_adv_data.vbatt[0] = 20 + (uint8_t)((m_sensors_data.vbatt-3500)/8.75); // 4.2V = 100%, 3.5V = 20%
    //} if (m_sensors_data.vbatt < 2740) {
    //    m_custom_adv_data.vbatt[0] = 0; // <2.74V = 0%
    //} else {
    //    m_custom_adv_data.vbatt[0] = (uint8_t)((m_sensors_data.vbatt-2740)/38);        // 3.5V = 20%,  2.74V = 0%
    //}
    m_custom_adv_data.vbatt[0] = (uint8_t)(m_sensors_data.vbatt >> 8);
    m_custom_adv_data.vbatt[1] = (uint8_t)m_sensors_data.vbatt;
}

/**@brief Function for updating the TEMP field of TLM*/
static void update_temp(void) {
    int32_t temp;
    sd_temp_get(&temp);

    m_sensors_data.tbuff_pos = (m_sensors_data.tbuff_pos + 1) % SENSORS_BUFFER_LEN;
    m_sensors_data.temp_samples[m_sensors_data.tbuff_pos] = (int16_t) temp;

    int32_t sum = 0;
    for (int i = 0; i < SENSORS_BUFFER_LEN; i++) {
        sum += m_sensors_data.temp_samples[i];
    }
    m_sensors_data.temp = sum/SENSORS_BUFFER_LEN;

    temp = m_sensors_data.temp * 25; // temp in 10bits converted to 0.01C units (100*t/4)    
    m_custom_adv_data.temp[1] = (uint8_t)(temp >> 8);
    m_custom_adv_data.temp[0] = (uint8_t)temp;
} 

static void increase_sec_cnt(void)
{
    m_sensors_data.le_sec_cnt++;

    uint32_t be_sec_cnt = BYTES_REVERSE_32BIT(m_sensors_data.le_sec_cnt);
    memcpy(m_custom_adv_data.sec_cnt, (uint8_t *)(&be_sec_cnt), 4);
}

static void update_vbatt_init(void) {
    uint32_t err_code;
    err_code = app_timer_start(m_battery_timer_id, UPDATE_ADV_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

int main(void) {
    // Initialize.
    #if NRF_LOG_ENABLED
    log_init();
    #endif
 
    nrf_power_dcdcen_set(true);

    timers_init();
    // buttons_leds_init();

    power_management_init();
    ble_stack_init();
    gap_params_init();
    battery_voltage_init();

    // Start execution.
    NRF_LOG_INFO("Long range Tile started");
    set_current_adv_params_and_start_advertising();
    update_vbatt_init();

    // Enter main loop.
    for (;;) {
        idle_state_handle();
    }
}

/**
 * @}
 */